In [506]:
import pandas as pd

In [507]:
df1= pd.read_csv('E:\houseprice project\Bengaluru_House_Data.csv')

In [508]:
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [509]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [510]:
df1.shape

(13320, 9)

In [511]:
df2=df1.drop(['area_type','society','balcony'],axis=1)

In [512]:
df2.head()

    availability                  location       size total_sqft  bath   price
0         19-Dec  Electronic City Phase II      2 BHK       1056   2.0   39.07
1  Ready To Move          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2  Ready To Move               Uttarahalli      3 BHK       1440   2.0   62.00
3  Ready To Move        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4  Ready To Move                  Kothanur      2 BHK       1200   2.0   51.00

In [513]:
df2.isnull().sum()

availability     0
location         1
size            16
total_sqft       0
bath            73
price            0
dtype: int64

In [514]:
df3=df2.dropna()

In [515]:
df3.isnull().sum()

availability    0
location        0
size            0
total_sqft      0
bath            0
price           0
dtype: int64

In [516]:
df3.head()

    availability                  location       size total_sqft  bath   price
0         19-Dec  Electronic City Phase II      2 BHK       1056   2.0   39.07
1  Ready To Move          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2  Ready To Move               Uttarahalli      3 BHK       1440   2.0   62.00
3  Ready To Move        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4  Ready To Move                  Kothanur      2 BHK       1200   2.0   51.00

In [517]:
df3['availability'].unique()

array(['19-Dec', 'Ready To Move', '18-May', '18-Feb', '18-Nov', '20-Dec',
       '17-Oct', '21-Dec', '19-Sep', '20-Sep', '18-Mar', '18-Apr',
       '20-Aug', '19-Mar', '17-Sep', '18-Dec', '17-Aug', '19-Apr',
       '18-Jun', '22-Dec', '22-Jan', '18-Aug', '19-Jan', '17-Jul',
       '18-Jul', '21-Jun', '20-May', '19-Aug', '18-Sep', '17-May',
       '17-Jun', '18-Oct', '21-May', '18-Jan', '20-Mar', '17-Dec',
       '16-Mar', '19-Jun', '22-Jun', '19-Jul', '21-Feb', '19-May',
       '17-Nov', '20-Oct', '20-Jun', '19-Feb', '21-Oct', '21-Jan',
       '17-Mar', '17-Apr', '22-May', '19-Oct', '21-Jul', '21-Nov',
       '21-Mar', '16-Dec', '22-Mar', '20-Jan', '21-Sep', '21-Aug',
       '14-Nov', '19-Nov', '15-Nov', '16-Jul', '15-Jun', '17-Feb',
       '20-Nov', '20-Jul', '16-Sep', '15-Oct', '20-Feb', '15-Dec',
       '16-Oct', '22-Nov', '15-Aug', '17-Jan', '16-Nov', '20-Apr',
       '16-Jan', '14-Jul'], dtype=object)

In [518]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [519]:
df3['bath'].unique()

array([ 2.,  5.,  3.,  4.,  6.,  1.,  9.,  8.,  7., 11., 10., 14., 27.,
       12., 16., 40., 15., 13., 18.])

In [520]:
import re
df3['bhks']=df3['size'].apply(lambda x: int(re.findall('\d+',x)[0].strip()))

In [521]:
df3.head()

,availability,location,size,total_sqft,bath,price,bhks
0,19-Dec,Electronic City Phase II,2 BHK,1056,2.0,39.07,2
1,Ready To Move,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4
2,Ready To Move,Uttarahalli,3 BHK,1440,2.0,62.00,3
3,Ready To Move,Lingadheeranahalli,3 BHK,1521,3.0,95.00,3
4,Ready To Move,Kothanur,2 BHK,1200,2.0,51.00,2

In [522]:
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [523]:
 def get_mean(x):
     if re.findall('-', x):
         ss= x.strip().split('-') 
         return ((float(ss[0])+float(ss[0]))/2)
     try:
        return float(x.strip())
     except:
        return None

In [524]:
df3['total_sqft_new']=df3['total_sqft'].apply(get_mean)

In [525]:
df3.head()

,availability,location,size,total_sqft,bath,price,bhks,total_sqft_new
0,19-Dec,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056.0
1,Ready To Move,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600.0
2,Ready To Move,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440.0
3,Ready To Move,Lingadheeranahalli,3 BHK,1521,3.0,95.00,3,1521.0
4,Ready To Move,Kothanur,2 BHK,1200,2.0,51.00,2,1200.0

In [526]:
df3.isnull().sum()

availability       0
location           0
size               0
total_sqft         0
bath               0
price              0
bhks               0
total_sqft_new    46
dtype: int64

In [527]:
df4= df3.dropna()

In [528]:
df4.isnull().sum()

availability      0
location          0
size              0
total_sqft        0
bath              0
price             0
bhks              0
total_sqft_new    0
dtype: int64

In [529]:
df4.groupby('bath')['bath'].count().sort_values()

bath
40.0       1
18.0       1
15.0       1
14.0       1
27.0       1
16.0       2
13.0       3
11.0       3
12.0       7
10.0      13
9.0       41
8.0       64
7.0      102
6.0      269
5.0      521
1.0      781
4.0     1222
3.0     3274
2.0     6893
Name: bath, dtype: int64

In [530]:
df5=df4[df4['bath'] <= 10]

In [531]:
df5.head()

,availability,location,size,total_sqft,bath,price,bhks,total_sqft_new
0,19-Dec,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056.0
1,Ready To Move,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600.0
2,Ready To Move,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440.0
3,Ready To Move,Lingadheeranahalli,3 BHK,1521,3.0,95.00,3,1521.0
4,Ready To Move,Kothanur,2 BHK,1200,2.0,51.00,2,1200.0

In [532]:
df6= df5.drop(['size','total_sqft'],axis=1)

In [533]:
df6.head()

    availability                  location  bath   price  bhks  total_sqft_new
0         19-Dec  Electronic City Phase II   2.0   39.07     2          1056.0
1  Ready To Move          Chikka Tirupathi   5.0  120.00     4          2600.0
2  Ready To Move               Uttarahalli   2.0   62.00     3          1440.0
3  Ready To Move        Lingadheeranahalli   3.0   95.00     3          1521.0
4  Ready To Move                  Kothanur   2.0   51.00     2          1200.0

In [534]:
df6[df6['total_sqft_new']/df6['bhks']<400]

        availability               location  bath  price  bhks  total_sqft_new
9      Ready To Move           Gandhi Bazar   6.0  370.0     6          1020.0
16     Ready To Move          Bisuvanahalli   3.0   48.0     3          1180.0
26     Ready To Move        Electronic City   1.0   23.1     2           660.0
29     Ready To Move        Electronic City   2.0   47.0     3          1025.0
31     Ready To Move          Bisuvanahalli   2.0   35.0     3          1075.0
...              ...                    ...   ...    ...   ...             ...
13281  Ready To Move        Margondanahalli   5.0  125.0     5          1375.0
13300  Ready To Move          Hosakerehalli   6.0  145.0     5          1500.0
13303  Ready To Move         Vidyaranyapura   5.0   70.0     5           774.0
13306  Ready To Move  Rajarajeshwari Nagara   5.0  325.0     4          1200.0
13311  Ready To Move       Ramamurthy Nagar   9.0  250.0     7          1500.0

[1480 rows x 6 columns]

In [535]:
df7=df6[df6['total_sqft_new']/df6['bhks']>400]

In [536]:
df7.head()

    availability                  location  bath   price  bhks  total_sqft_new
0         19-Dec  Electronic City Phase II   2.0   39.07     2          1056.0
1  Ready To Move          Chikka Tirupathi   5.0  120.00     4          2600.0
2  Ready To Move               Uttarahalli   2.0   62.00     3          1440.0
3  Ready To Move        Lingadheeranahalli   3.0   95.00     3          1521.0
4  Ready To Move                  Kothanur   2.0   51.00     2          1200.0

In [537]:
df7['price_per_sqft']=df7['price']*100000/df7['total_sqft_new']

In [538]:
df7.head()

,availability,location,bath,price,bhks,total_sqft_new,price_per_sqft
0,19-Dec,Electronic City Phase II,2.0,39.07,2,1056.0,3699.810606
1,Ready To Move,Chikka Tirupathi,5.0,120.00,4,2600.0,4615.384615
2,Ready To Move,Uttarahalli,2.0,62.00,3,1440.0,4305.555556
3,Ready To Move,Lingadheeranahalli,3.0,95.00,3,1521.0,6245.890861
4,Ready To Move,Kothanur,2.0,51.00,2,1200.0,4250.000000

In [539]:
df7['price_per_sqft'].describe()

count     11446.000000
mean       6131.272179
std        3932.982959
min         267.829813
25%        4202.938655
50%        5263.157895
75%        6768.855941
max      176470.588235
Name: price_per_sqft, dtype: float64

In [540]:
def rmv_price_outlier(df):
    df_new=pd.DataFrame()
    for key,sdf in df.groupby('location'):
        m = sdf['price_per_sqft'].mean()
        s = sdf['price_per_sqft'].std()
        rdf = sdf[(sdf['price_per_sqft'] <=m+s) & (sdf['price_per_sqft']>m-s)]
        df_new = pd.concat([df_new,rdf],ignore_index = True)
    return df_new

In [541]:
df8= rmv_price_outlier(df7)

In [542]:
df8.head()

,availability,location,bath,price,bhks,total_sqft_new,price_per_sqft
0,Ready To Move,Devarabeesana Halli,2.0,70.0,2,1100.0,6363.636364
1,Ready To Move,Devarabeesana Halli,3.0,150.0,3,1672.0,8971.291866
2,Ready To Move,Devarabeesana Halli,3.0,149.0,3,1750.0,8514.285714
3,Ready To Move,Devarabeesana Halli,3.0,150.0,3,1750.0,8571.428571
4,18-May,Devarachikkanahalli,2.0,44.0,3,1250.0,3520.000000

In [543]:
df8.shape

(8691, 7)

In [544]:
availability_dummy = pd.get_dummies(df8['availability'],drop_first=True)

In [545]:
availability_dummy

,14-Nov,15-Aug,15-Jun,15-Nov,15-Oct,16-Dec,16-Jul,16-Mar,16-Nov,16-Oct,...,21-Nov,21-Oct,21-Sep,22-Dec,22-Jan,22-Jun,22-Mar,22-May,22-Nov,Ready To Move
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8686,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8687,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8688,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
8689,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
8690,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [546]:
location_dummy = pd.get_dummies(df8['location'],drop_first=True)

In [547]:
df9=pd.concat([df8, availability_dummy,location_dummy],axis=1)

In [548]:
df9.head

<bound method NDFrame.head of        availability              location  bath   price  bhks  total_sqft_new  \
0     Ready To Move   Devarabeesana Halli   2.0   70.00     2          1100.0
1     Ready To Move   Devarabeesana Halli   3.0  150.00     3          1672.0
2     Ready To Move   Devarabeesana Halli   3.0  149.00     3          1750.0
3     Ready To Move   Devarabeesana Halli   3.0  150.00     3          1750.0
4            18-May   Devarachikkanahalli   2.0   44.00     3          1250.0
...             ...                   ...   ...     ...   ...             ...
8686         18-Nov          manyata park   3.0   84.83     3          1780.0
8687         18-Nov          manyata park   2.0   61.99     2          1322.0
8688  Ready To Move              tc.palya   2.0   48.00     2           880.0
8689         18-Apr              tc.palya   2.0   55.00     2          1000.0
8690         18-Apr              tc.palya   2.0   78.00     3          1400.0

      price_per_sqft  14-Nov  15-Aug  15-Jun  ...  Yelahanka  \
0        6363.636364       0       0       0  ...          0
1        8971.291866       0       0       0  ...          0
2        8514.285714       0       0       0  ...          0
3        8571.428571       0       0       0  ...          0
4        3520.000000       0       0       0  ...          0
...              ...     ...     ...     ...  ...        ...
8686     4765.730337       0       0       0  ...          0
8687     4689.107413       0       0       0  ...          0
8688     5454.545455       0       0       0  ...          0
8689     5500.000000       0       0       0  ...          0
8690     5571.428571       0       0       0  ...          0

      Yelahanka New Town  Yelenahalli  Yemlur  Yeshwanthpur  \
0                      0            0       0             0
1                      0            0       0             0
2                      0            0       0             0
3                      0            0       0             0
4                      0            0       0             0
...                  ...          ...     ...           ...
8686                   0            0       0             0
8687                   0            0       0             0
8688                   0            0       0             0
8689                   0            0       0             0
8690                   0            0       0             0

      Yeshwanthpur Industrial Suburb  cooketown  frazertown  manyata park  \
0                                  0          0           0             0
1                                  0          0           0             0
2                                  0          0           0             0
3                                  0          0           0             0
4                                  0          0           0             0
...                              ...        ...         ...           ...
8686                               0          0           0             1
8687                               0          0           0             1
8688                               0          0           0             0
8689                               0          0           0             0
8690                               0          0           0             0

      tc.palya
0            0
1            0
2            0
3            0
4            0
...        ...
8686         0
8687         0
8688         1
8689         1
8690         1

[8691 rows x 805 columns]>

In [549]:
df10=df9.drop(['availability','location','price_per_sqft'],axis=1)

In [550]:
df10.head()

,bath,price,bhks,total_sqft_new,14-Nov,15-Aug,15-Jun,15-Nov,15-Oct,16-Dec,...,Yelahanka,Yelahanka New Town,Yelenahalli,Yemlur,Yeshwanthpur,Yeshwanthpur Industrial Suburb,cooketown,frazertown,manyata park,tc.palya
0,2.0,70.0,2,1100.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,3.0,150.0,3,1672.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3.0,149.0,3,1750.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,3.0,150.0,3,1750.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,2.0,44.0,3,1250.0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [551]:
X= df10.drop(['price'],axis=1)
y=df10['price']

In [552]:
from sklearn.model_selection import train_test_split
X_train, X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=0)

In [553]:
len(X_train)

6952

In [554]:
len(X_test)

1739

In [564]:
from sklearn.linear_model import LinearRegression
from sklearn.tree import DecisionTreeRegressor
from sklearn.model_selection import cross_val_score

In [575]:
model_score = cross_val_score(estimator = LinearRegression(),X=X_train,y=y_train,cv=5)
model_score

array([-5.07526128e+13, -2.21206342e+15, -1.06303557e+12, -1.50514804e+15,
       -1.42261917e+12])

In [576]:
model_score.mean()

-754089945542039.2

In [577]:
model_score.std()

929302529211658.2

In [578]:
model_score = cross_val_score(estimator =DecisionTreeRegressor(),X=X_train,y=y_train,cv=5)
model_score

array([0.74024449, 0.16556368, 0.4758015 , 0.67468624, 0.70252882])

In [581]:
model_score.mean()

0.5517649474776738

In [583]:
model_score.std()

0.21367535653061082

In [584]:
model_dtr= DecisionTreeRegressor()
model_dtr.fit(X_train,y_train)

DecisionTreeRegressor()

In [585]:
model_lr= LinearRegression()
model_lr.fit(X_train,y_train)

LinearRegression()